export const imp = (number) =>
  require(`../assets/products/Product (${number}).png`);

export const DUMMY_PRODUCT_DATA = [
  {
    id: "p0",
    name: " E14 پارکت رینبو مدل اکوپلاس بدون شیار ",
    info: "لورم ایپسوم متن",
    color: "#B2ABB2",
  },
  {
    id: "p1",
    name: "پارکت رینبو مدل براق سیلور شاین ",
    info: "لورم ایپسوم متن",
    color: "#424242",
  },
  {
    id: "p2",
    name: "پارکت لمینیت آرتنز مدل آمالفی کد 451",
    info: "لورم ایپسوم متن",
    color: "#CD5C5C",
  },
  {
    id: "p3",
    name: "15cm پارکت رینبو مدل کامپلکس براون  ",
    info: "لورم ایپسوم متن",
    color: "#7B584C",
  },
  {
    id: "p4",
    name: "پارکت رینبو مدل کامپلکس طرح آنتیک",
    info: "لورم ایپسوم متن",
    color: "#562E1F",
  },
  {
    id: "p5",
    name: "پارکت رینبو مدل کامپلکس  لایت  8 عددی",
    info: "لورم ایپسوم متن",
    color: "#B0B0B0",
  },
  {
    id: "p6",
    name: "پارکت رینبو مدل کامپلکس اولد چری",
    info: "لورم ایپسوم متن",
    color: "#3F1E1F",
  },
  {
    id: "p7",
    name: " E18 پارکت رینبو مدل اکوپلاس کد ",
    info: "لورم ایپسوم متن",
    color: "#A98274",
  },
  {
    id: "p8",
    name: " E21 پارکت رینبو مدل اکوپلاس شیاردار کد ",
    info: "لورم ایپسوم متن",
    color: "#392622",
  },
  {
    id: "p9",
    name: "پارکت رینبو مدل کاپوچینو اوک",
    info: "لورم ایپسوم متن",
    color: "#3F1E1F",
  },
  {
    id: "p10",
    name: "E19 پارکت رینبو مدل اکوپلاس  کد  ",
    info: "لورم ایپسوم متن",
    color: "#C3C3C3",
  },
  {
    id: "p11",
    name: "پارکت رینبو مدل کامپلکس اولد چری",
    info: "لورم ایپسوم متن",
    color: "#3F1E1F",
  },
];
