export const imp = (path) => require("../assets/" + path);

export const DUMMY_PRODUCT_DATA = [
  {
    id: "p0",
    name: " E14 پارکت رینبو مدل اکوپلاس بدون شیار ",
    info: "لورم ایپسوم متن",
    color: "#B2ABB2",
  },
  {
    id: "p1",
    name: "پارکت رینبو مدل براق سیلور شاین ",
    info: "لورم ایپسوم متن",
    color: "#424242",
  },
  {
    id: "p2",
    name: "پارکت لمینیت آرتنز مدل آمالفی کد 451",
    info: "لورم ایپسوم متن",
    color: "#CD5C5C",
  },
  {
    id: "p3",
    name: "15cm پارکت رینبو مدل کامپلکس براون  ",
    info: "لورم ایپسوم متن",
    color: "#7B584C",
  },
  {
    id: "p4",
    name: "پارکت رینبو مدل کامپلکس طرح آنتیک",
    info: "لورم ایپسوم متن",
    color: "#562E1F",
  },
  {
    id: "p5",
    name: "پارکت رینبو مدل کامپلکس  لایت  8 عددی",
    info: "لورم ایپسوم متن",
    color: "#B0B0B0",
  },
  {
    id: "p6",
    name: "پارکت رینبو مدل کامپلکس اولد چری",
    info: "لورم ایپسوم متن",
    color: "#3F1E1F",
  },
  {
    id: "p7",
    name: " E18 پارکت رینبو مدل اکوپلاس کد ",
    info: "لورم ایپسوم متن",
    color: "#A98274",
  },
  {
    id: "p8",
    name: " E21 پارکت رینبو مدل اکوپلاس شیاردار کد ",
    info: "لورم ایپسوم متن",
    color: "#392622",
  },
  {
    id: "p9",
    name: "پارکت رینبو مدل کاپوچینو اوک",
    info: "لورم ایپسوم متن",
    color: "#3F1E1F",
  },
  {
    id: "p10",
    name: "E19 پارکت رینبو مدل اکوپلاس  کد  ",
    info: "لورم ایپسوم متن",
    color: "#C3C3C3",
  },
  {
    id: "p11",
    name: "پارکت رینبو مدل کامپلکس اولد چری",
    info: "لورم ایپسوم متن",
    color: "#3F1E1F",
  },
];

export const DUMMY_HOME_PART_DATA = [
  {
    id: "tp0",
    name: "حمام - دستشویی",
    info: "۱۲۰۰ محصول مرتبط",
  },
  {
    id: "tp1",
    name: "اتاق غذاخوری",
    info: "۱۲۰۰ محصول مرتبط",
  },
  {
    id: "tp2",
    name: "اتاق خواب",
    info: "۱۲۰۰ محصول مرتبط",
  },
  {
    id: "tp3",
    name: "اتاق کودک",
    info: "۱۲۰۰ محصول مرتبط",
  },
  {
    id: "tp4",
    name: "حمام - دستشویی",
    info: "محصول مرتبط ۱۲۰۰",
  },
  {
    id: "tp5",
    name: "اتاق غذاخوری",
    info: "۱۲۰۰ محصول مرتبط",
  },
  {
    id: "tp6",
    name: "اتاق خواب",
    info: "۱۲۰۰ محصول مرتبط",
  },
  {
    id: "tp7",
    name: "اتاق کودک",
    info: "۱۲۰۰ محصول مرتبط",
  },
  {
    id: "tp8",
    name: "حمام - دستشویی",
    info: "محصول مرتبط ۱۲۰۰",
  },
  {
    id: "tp9",
    name: "اتاق غذاخوری",
    info: "۱۲۰۰ محصول مرتبط",
  },
  {
    id: "tp10",
    name: "اتاق خواب",
    info: "۱۲۰۰ محصول مرتبط",
  },
  {
    id: "tp11",
    name: "اتاق کودک",
    info: "۱۲۰۰ محصول مرتبط",
  },
  {
    id: "tp12",
    name: "حمام - دستشویی",
    info: "محصول مرتبط ۱۲۰۰",
  },
  {
    id: "tp13",
    name: "اتاق غذاخوری",
    info: "۱۲۰۰ محصول مرتبط",
  },
  {
    id: "tp14",
    name: "اتاق خواب",
    info: "۱۲۰۰ محصول مرتبط",
  },
];

export const DUMMY_PERSON_DATA = [
  { id: "e0", name: "مرسده خلج", post: "مدیر بازاریابی" },
  { id: "e1", name: "علیرضا قیامی", post: "کارشناس فروش" },
  { id: "e2", name: "حمیدرضا مجذوبی", post: "مدیر عامل" },
  { id: "e3", name: "سپهر سعیدی", post: "مدیر فروش" },
  { id: "e4", name: "مرسده خلج", post: "مدیر بازاریابی" },
  { id: "e5", name: "علیرضا قیامی", post: "کارشناس فروش" },
  { id: "e6", name: "حمیدرضا مجذوبی", post: "مدیر عامل" },
  { id: "e7", name: "سپهر سعیدی", post: "مدیر فروش" },
];

export const DUMMY_FAQ_DATA = [
  {
    question: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ؟",
    answer:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطر آنچنان که لازم است",
  },
  {
    question: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ؟",
    answer:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطر آنچنان که لازم است",
  },
  {
    question: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ؟",
    answer:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطر آنچنان که لازم است",
  },
  {
    question: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ؟",
    answer:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطر آنچنان که لازم است",
  },
  {
    question: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ؟",
    answer:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطر آنچنان که لازم است",
  },
];

export const DUMMY_DEMO_PRODUCTS = [
  {
    name: "زینتی گرانادا مشکی",
    size: "۲۰ * ۲۰",
  },
  {
    name: "آدورن لئون",
    size: "۲۰ * ۲۰",
  },
  {
    name: "گلبرگ خاکستری",
    size: "۲۰ * ۲۰",
  },
  {
    name: "وینیل ورق بوهو کلمبا",
    size: "۲۰ * ۲۰",
  },
  {
    name: "زینتی گرانادا مشکی",
    size: "۲۰ * ۲۰",
  },
  {
    name: "آدورن لئون",
    size: "۲۰ * ۲۰",
  },
  {
    name: "گلبرگ خاکستری",
    size: "۲۰ * ۲۰",
  },
  {
    name: "وینیل ورق بوهو کلمبا",
    size: "۲۰ * ۲۰",
  },
  {
    name: "زینتی گرانادا مشکی",
    size: "۲۰ * ۲۰",
  },
  {
    name: "آدورن لئون",
    size: "۲۰ * ۲۰",
  },
  {
    name: "گلبرگ خاکستری",
    size: "۲۰ * ۲۰",
  },
  {
    name: "وینیل ورق بوهو کلمبا",
    size: "۲۰ * ۲۰",
  },
  {
    name: "زینتی گرانادا مشکی",
    size: "۲۰ * ۲۰",
  },
  {
    name: "آدورن لئون",
    size: "۲۰ * ۲۰",
  },
  {
    name: "گلبرگ خاکستری",
    size: "۲۰ * ۲۰",
  },
  {
    name: "وینیل ورق بوهو کلمبا",
    size: "۲۰ * ۲۰",
  },
  {
    name: "زینتی گرانادا مشکی",
    size: "۲۰ * ۲۰",
  },
  {
    name: "آدورن لئون",
    size: "۲۰ * ۲۰",
  },
  {
    name: "گلبرگ خاکستری",
    size: "۲۰ * ۲۰",
  },
  {
    name: "وینیل ورق بوهو کلمبا",
    size: "۲۰ * ۲۰",
  },
];

export const DUMMY_PRODUCT_FAMILY = [
  { name: "چوب سخت" },
  { name: "کاشی" },
  { name: "وینیل" },
  { name: "وینیل لوکس" },
  { name: "لمینت" },
  { name: "فرش" },
  { name: "کاشی فرش" },
];

export const DUMMY_MATERIAL_NAMES = [
  { name: "سرامیک" },
  { name: "سنگ مرمر" },
  { name: "نایلون" },
  { name: "ظروف چینی" },
  { name: "لمینت" },
];

export const DUMMY_COLOR_CODES = [
  { code: "#36F34A" },
  { code: "#8CF34C" },
  { code: "#E4FB41" },
  { code: "#FFAB2F" },
  { code: "#ED3737" },
  { code: "#FFFFFF" },
  { code: "#000000" },
  { code: "#C4C841" },
  { code: "#CE2E2F" },
  { code: "#FD41FE" },
  { code: "#8635ED" },
  { code: "#3E60DD" },
  { code: "#3AA4E1" },
  { code: "#58EBC9" },
  { code: "#BDBDBD" },
  { code: "#474763" },
  { code: "#8D8ADB" },
  { code: "#A05AC3" },
  { code: "#4031A4" },
  { code: "#3D9B9C" },
  { code: "#4BAB3A" },
];
